### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_policy_fragment.auth will be updated in-place
  ~ resource "azurerm_api_management_policy_fragment" "auth" {
        id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/policyFragments/io-com-app-session-fragment"
        name              = "io-com-app-session-fragment"
      ~ value             = <<-EOT
          - <fragment>
          - 	<!-- Extract the token from the Authorization Header -->
          - 	<set-variable name="token" value="@{     string[] values;     return context.Request.Headers.TryGetValue(&quot;Authorization&quot;, out values) ? values.FirstOrDefault() : &quot;&quot;;   }" />
          - 	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          - 	<choose>
          - 		<when condition="@(       string.IsNullOrEmpty((string)context.Variables[&quot;token&quot;]) ||       !(((string)context.Variables[&quot;token&quot;]).StartsWith(&quot;Bearer &quot;, StringComparison.OrdinalIgnoreCase)) ||       string.IsNullOrWhiteSpace(((string)context.Variables[&quot;token&quot;]).Substring(7))     )">
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response>
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 	</choose>
          - 	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
          - 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          - 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          - 		<set-method>GET</set-method>
          - 		<set-header name="Content-Type" exists-action="override">
          - 			<value>application/json</value>
          - 		</set-header>
          - 		<set-header name="Authorization" exists-action="override">
          - 			<value>@(((string)context.Variables["token"]))</value>
          - 		</set-header>
          - 	</send-request>
          - 	<choose>
          - 		<!-- If 200 return set the x-user header as the base64 of the response -->
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 200)">
          - 			<!-- Parse the introspectionResponse as a string -->
          - 			<set-variable name="userData" value="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).Body.As&lt;string&gt;())" />
          - 			<!-- Remove the Authorization Header -->
          - 			<set-header name="Authorization" exists-action="delete" />
          - 			<!-- Set the x-user header with the user data -->
          - 			<set-header name="x-user" exists-action="override">
          - 				<value>@(
          -           Convert.ToBase64String(
          -               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          -           )
          -         )</value>
          - 			</set-header>
          - 		</when>
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 401)">
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 		<otherwise>
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="500" reason="Internal Server Error" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</otherwise>
          - 	</choose>
          + <fragment>
          + 	<!-- Extract the token from the Authorization Header -->
          +   <set-variable name="token" value='@{
          +     string[] values;
          +     return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";
          +   }' />
          + 
          +   <!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          +   <choose>
          +     <when condition='@(
          +       string.IsNullOrEmpty((string)context.Variables["token"]) ||
          +       !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||
          +       string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))
          +     )'>
          +       <set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          +       </set-header>
          +       <return-response>
          +         <set-status code="401" reason="Unauthorized" />
          +         <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +       </return-response>
          +   </when>
          +   </choose>
          + 
          +   <!-- Call the session manager, pasing the bearer token, to get the user identity -->
          + 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          + 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          + 		<set-method>GET</set-method>
          + 		<set-header name="Content-Type" exists-action="override">
          +       <value>application/json</value>
          + 		</set-header>
          + 		<set-header name="Authorization" exists-action="override">
          +       <value>@(((string)context.Variables["token"]))</value>
          + 		</set-header>
          + 	</send-request>
          + 
          + 	<choose>
          +     <!-- If 200 return set the x-user header as the base64 of the response -->
          + 		<when condition='@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)'>
          + 			<!-- Parse the introspectionResponse as a string -->
          + 			<set-variable name="userData" value='@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())' />
          + 			<!-- Remove the Authorization Header -->
          + 			<set-header name="Authorization" exists-action="delete" />
          + 			<!-- Set the x-user header with the user data -->
          + 			<set-header name="x-user" exists-action="override">
          + 				<value>@(
          +           Convert.ToBase64String(
          +               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          +           )
          +         )</value>
          + 			</set-header>
          + 		</when>
          + 
          + 		<when condition='@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)'>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="401" reason="Unauthorized" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          + 			</return-response>
          + 		</when>
          + 
          + 		<otherwise>
          + 			<set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          + 			</set-header>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="500" reason="Internal Server Error" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +         </return-response>
          + 		</otherwise>
          + 	</choose>
            </fragment>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.storage_api_weu.azurerm_storage_container.message_content_itn will be created
  + resource "azurerm_storage_container" "message_content_itn" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "message-content"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncomst01"
    }

  # module.cosmos.module.io_com_cosmos_account.azurerm_cosmosdb_account.this will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "this" {
        id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
        name                                     = "io-p-itn-com-cosno-01"
      ~ tags                                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_cosmos_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.0" -> "0.2.0"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cosmos.module.io_com_cosmos_account.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-com-cosno-01] Provisioned Throughput Exceeded"
        name                     = "[io-p-itn-com-cosno-01] Provisioned Throughput Exceeded"
      ~ tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_cosmos_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.0" -> "0.2.0"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cosmos.module.io_com_cosmos_account.azurerm_private_endpoint.sql will be updated in-place
  ~ resource "azurerm_private_endpoint" "sql" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-cosno-pep-01"
        name                          = "io-p-itn-com-cosno-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_cosmos_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.0" -> "0.2.0"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_autoscaler.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-com-citizen-as-01"
        name                = "io-p-itn-com-citizen-as-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_app_service_plan_autoscaler"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.1.3"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```

</details>
